{"id": "0", "text": ["While data augmentation is an important trick to boost the accuracy of deep learning methods in computer vision tasks, its study in natural language tasks is still very limited."]}
{"id": "1", "text": ["The automatic generation of Multiple Choice Questions (MCQ) has the potential to reduce the time educators spend on student assessment significantly."]}
{"id": "2", "text": ["We also report results on dependency parsing reranking achieving competitive performance."]}
{"id": "3", "text": ["Research shows the benefit of using active learning in computer science education; however, only limited resources (such as, prior publications) exist for systems courses (including architecture, networking, operating systems)."]}
{"id": "4", "text": ["Sensing interfaces relying on head or facial gestures provide effective solutions for hands-free scenarios."]}
{"id": "5", "text": ["To facilitate the generation of open-ended questions, we propose CONSISTENT, a new end-to-end system for generating open-ended questions that are answerable from and faithful to the input text."]}
{"id": "6", "text": ["Experimental results on both small scale and large scale machine translation data sets demonstrate the superiority of our method over strong baselines."]}
{"id": "7", "text": ["Our results hold for a large class of Hadamard manifolds including hyperbolic spaces and the symmetric space SL( n ) / SO( n ) of positive deﬁnite n × n matrices of determinant one."]}
{"id": "8", "text": ["Yet we also find that finite-horizon MC is not inferior to TD, even when rewards are sparse or delayed."]}
{"id": "9", "text": ["Monopolies, international power dynamics, race, and access to capital open or constrain technological possibilities at least as much as device-centric or user-focused constraints do."]}
{"id": "10", "text": ["We further enhance the modeling power of TreeLSTM by explicitly representing the correlations between left and right dependents."]}
{"id": "11", "text": ["To mitigate this issue, we propose ThroughHand, a novel tactile interaction that enables users with visual impairments to interact with multiple dynamic objects in real time."]}
{"id": "12", "text": ["Conducting experiments with three different regression methods on Facebook and Twitter data, we find that both word embeddings and word clusters help to reduce forecasting errors in comparison to purely macroeconomic models."]}
{"id": "13", "text": ["To preserve user privacy and protect business-sensitive statistics, the data is fully anonymized, sampled and limited to five user origin markets."]}
{"id": "14", "text": ["For the case of identical means and variances, in particular, we get a guarantee of O(log (r/m)) that converges to optimality as the number of items grows large."]}
{"id": "15", "text": ["This dependence establishes a new fundamental limit for all practical applications of statistical learning theory."]}
{"id": "16", "text": ["Our experiments demonstrate that this established generalization exhibits a surprising lack of universality; namely, lower perplexity is not always human-like."]}
{"id": "17", "text": ["Board games present accessibility barriers for players with visual impairment since they often employ visuals alone to communicate gameplay information."]}
{"id": "18", "text": ["To enhance the current forecasting frameworks’ capability, we proposed optimized long short-term memory networks (LSTM) to forecast COVID-19 cases and reduce mean absolute error."]}
{"id": "19", "text": ["Notably, we find systematic textual evidence that these top values are being defined and applied with assumptions and implications generally supporting the centralization of power."]}