{"id": "0", "text": ["We introduce a new clustering method, which takes into account temporal co-occurrence of words, in addition to their semantic similarity, in order to create predictors relevant to the forecasting problem."]}
{"id": "1", "text": ["Conducting experiments with three different regression methods on Facebook and Twitter data, we find that both word embeddings and word clusters help to reduce forecasting errors in comparison to purely macroeconomic models."]}
{"id": "2", "text": ["Computing, together with jewelry design and 3D printing offers an innovative introduction to the possibilities of technology and programming."]}
{"id": "3", "text": ["Laser cutter users face difficulties distinguishing between visually similar materials."]}
{"id": "4", "text": ["SensiCut enables new applications, such as automatically partitioning designs when engraving on multi-material objects or adjusting their geometry based on the kerf of the identified material."]}
{"id": "5", "text": ["Initial findings are positive and suggest opportunities for improvement."]}
{"id": "6", "text": ["This paper presents the first study of how expressions that refer to the same entity develop over time."]}
{"id": "7", "text": ["Our results reach 10-30% absolute improvement over a majority-class baseline."]}
{"id": "8", "text": ["In this paper, we propose ChewIt -- a novel intraoral input interface."]}
{"id": "9", "text": ["Our system obtained the first place for the English-to-French task according to human evaluation."]}
{"id": "10", "text": ["New methods (e.g., user centrism); expected types of interaction (user with device); and potential applications (urban navigation) can extend the boundaries of these possibilities."]}
{"id": "11", "text": ["We discuss the implications for technology development in Africa and beyond."]}
{"id": "12", "text": ["Finally, we motivate future research in evaluation and classroom integration in the field of speech synthesis for language revitalization."]}
{"id": "13", "text": ["For example, preliminary results with English data show that a FastSpeech2 model trained with 1 hour of training data can produce speech with comparable naturalness to a Tacotron2 model trained with 10 hours of data."]}
{"id": "14", "text": ["This paper reports a corpus study as a first step towards computational work on social and discourse functions of metaphor."]}
{"id": "15", "text": ["Over the last few decades, multiple efforts have been undertaken to investigate incorrect translations caused by the polysemous nature of words."]}
{"id": "16", "text": ["Although text-based models are known to be vulnerable to adversarial attacks, whether stock prediction models have similar vulnerability given necessary constraints is underexplored."]}
{"id": "17", "text": ["Our results show that the proposed attack method can achieve consistent success rates and cause significant monetary loss in trading simulation by simply concatenating a perturbed but semantically similar tweet."]}
{"id": "18", "text": ["Computing, together with jewelry design and 3D printing offers an innovative introduction to the possibilities of technology and programming."]}
{"id": "19", "text": ["The participants then saw their design creations built through 3D printing."]}