{"id": "0", "text": ["With the commercialization of these systems, researchers are becoming more aware of the biases that these applications can contain and are attempting to address them."]}
{"id": "1", "text": ["We therefore construct event-specific corpora from a large static background corpus, the newsroom dataset, using differing, relatively simple IR methods based on raw text alone."]}
{"id": "2", "text": ["More users are able to send and receive encrypted emails without mistakenly revealing sensitive information."]}
{"id": "3", "text": ["Many online personalization platforms today are recommending heterogeneous contents in a multi-sided marketplace consisting of consumers, merchants and other partners."]}
{"id": "4", "text": ["Auditing NLP systems for computational harms like surfacing stereotypes is an elusive goal."]}
{"id": "5", "text": ["A prominent approach to combating online misinformation is to debunk false content."]}
{"id": "6", "text": ["Although being a pressing issue, understanding how robotic systems can replicate and amplify inequalities and injustice among underrepresented communities is still in its infancy among social science and technical communities."]}
{"id": "7", "text": ["Content delivery mechanisms and active learning/project-based experiences for undergraduate students have developed and matured at a dramatic pace in recent years."]}
{"id": "8", "text": ["In this paper, we describe metrics for measuring political bias in GPT-2 generation and propose a reinforcement learning (RL) framework for mitigating political biases in generated text."]}
{"id": "9", "text": ["Nowadays, researchers are looking for ways to adapt education to include technology and more engaging methods."]}
{"id": "10", "text": ["Given the globally aging population and proliferation of AI, there is a need to critically examine the presence of age-related bias in AI systems."]}
{"id": "11", "text": ["K-12 computer science (CS) teachers are often the only teachers of the subject at their school."]}
{"id": "12", "text": ["We describe work in progress on detecting and understanding the moral biases of news sources by combining framing theory with natural language processing."]}
{"id": "13", "text": ["This research requires the creation and analysis of complex queries which are often above the technical expertise of the domain users."]}
{"id": "14", "text": ["We present fairkit-learn, an interactive Python toolkit designed to support data scientists' ability to reason about and understand model fairness."]}
{"id": "15", "text": ["To enable the parametric design of FlexHaptic modules, we provide a design editor that converts user-specified haptic properties into underlying mechanical structures of haptic modules."]}
{"id": "16", "text": ["Private Webmail 2.0 (Pwm 2.0) improves upon the current state of the art by increasing the usability and practical security of secure email for ordinary users."]}
{"id": "17", "text": ["Used internationally, initial qualitative feedback from teachers who attended pilot CS-SIC workshops was emphatically positive."]}
{"id": "18", "text": ["To preserve user privacy and protect business-sensitive statistics, the data is fully anonymized, sampled and limited to five user origin markets."]}
{"id": "19", "text": ["We then derive an effective iterative algorithm to infer the parameters of our model, along with the proof of correctness."]}