{"id": "0", "text": ["This work contributes Technical Reasoning as a theoretical model for the design of digital tools."]}
{"id": "1", "text": ["Since there is a very limited number of available real traces in the public domain, synthetic models for movement pattern generation must be used."]}
{"id": "2", "text": ["Theoretically aligned to Vygotsky's zone of proximal development, CS-SCIC places research-based instructional strategies on a simple learning continuum."]}
{"id": "3", "text": ["After a break, caused by the Covid-19 pandemic, the project was relaunched in early 2022 with a second working draft of an annotation scheme, which is discussed in this paper."]}
{"id": "4", "text": ["Our results significantly improve several previous results for several important combinatorial constraints, and provide a tighter understanding of the general Best-Set problem."]}
{"id": "5", "text": ["Extensive experimental results on real-world trust networks demonstrate the superior performance of our proposed method over the state-of-the-arts."]}
{"id": "6", "text": ["This dependence establishes a new fundamental limit for all practical applications of statistical learning theory."]}
{"id": "7", "text": ["However, little is known about how technology supports this activism work, despite the fact that tools such as Social Networking Applications (SNAs) are increasingly being leveraged in such contexts."]}
{"id": "8", "text": ["The lack of a formal proof prompted Brunel, Moitra, Rigollet and Urschel (2017a) to conjecture that, in opposition to Kulesza’s conjecture, there exists a polynomial-time algorithm for computing a maximum-likelihood DPP."]}
{"id": "9", "text": ["There is no generally preferred drawing modality, but most participants rated the robust and well-known menu-based interaction as very good."]}
{"id": "10", "text": ["The algorithms used for this task to date either optimize over a limited family of DPPs, or use local improvement heuristics that do not provide theoretical guarantees of optimality."]}
{"id": "11", "text": ["The system is available at https://dynabench.org/ and the full library can be found at https://github.com/facebookresearch/dynabench."]}
{"id": "12", "text": ["In this paper we propose a new mobility model founded on social network theory."]}
{"id": "13", "text": ["In a submission run result, the proposed model achieved an average F1 score of 66.1 % in the out-of-domain setting, which is a 4.3 percentage point improvement over the official BERT baseline model."]}
{"id": "14", "text": ["We conduct a systematic mapping review of how cognitive load theory (CLT) has been used across a number of leading computing education research (CER) forums since 2010."]}
{"id": "15", "text": [" This problem, tree trace reconstruction, generalizes string trace reconstruction, which corresponds to the tree being a path."]}
{"id": "16", "text": ["However, there are no known results in which the deeper architecture leverages this advantage into a provable optimization guarantee."]}
{"id": "17", "text": ["We designed a location-based game called City Explorer to investigate how transit commuters capture, share, and view community information that is specifically tied to locations."]}
{"id": "18", "text": ["A main challenge in subspace clustering is to quickly calculate a 'good' affinity matrix. ℓ0, ℓ1, ℓ2 or nuclear norm regularization is used to construct the affinity matrix in many subspace clustering methods because of their theoretical guarantees and empirical success."]}
{"id": "19", "text": ["We present a computational model to predict users' spatio-temporal visual attention on WIMP-style (windows, icons, menus, pointer) graphical user interfaces."]}