{"id": "0", "text": ["We have analyzed the papers that contained any experimental analysis of software projects for their potentiality of being replicated."]}
{"id": "1", "text": ["Many online personalization platforms today are recommending heterogeneous contents in a multi-sided marketplace consisting of consumers, merchants and other partners."]}
{"id": "2", "text": ["Source code, documentation, and pre-trained models are available at https://github.com/HIT-SCIR/ltp."]}
{"id": "3", "text": ["We further develop an efficient optimization solution for ranking and recommendation in large-scale online systems in real time."]}
{"id": "4", "text": ["Advice is offered on how to communicate our empirical results in a clear, accurate, and transparent way without using any tests or p-values."]}
{"id": "5", "text": ["We find causal evidence that being corrected decreases the quality, and increases the partisan slant and language toxicity, of the users’ subsequent retweets (but has no significant effect on primary tweets)."]}
{"id": "6", "text": ["The recent “replication crisis” in the social sciences has led to increased attention on what statistically significant results entail."]}
{"id": "7", "text": ["The National Science Foundation Division of Undergraduate Education is preparing to have a nationwide dialogue with STEM communities and industry partners on this topic."]}
{"id": "8", "text": ["We establish the fundamental concepts of significance testing and discuss the specific aspects of NLP tasks, experimental setups and evaluation measures that affect the choice of significance tests in NLP research."]}
{"id": "9", "text": ["The system was evaluated in an experiment where two types of virtual tutors were proposed and generated considering two virtual game programming classes."]}
{"id": "10", "text": ["While recent progress in the field of ML has been significant, the reproducibility of these cutting-edge results is often lacking, with many submissions lacking the necessary information in order to ensure subsequent reproducibility."]}
{"id": "11", "text": ["These tools, including a CS coaching toolkit and instructional practice evidence guide, have the potential to drive impactful, job-embedded development."]}
{"id": "12", "text": ["Based on over two hundred participants, the survey results confirm earlier observations, that successful reproducibility requires more than having access to code and data."]}
{"id": "13", "text": ["Our tool, called CorpSum, shows a 43.12 point increase in the mean SUS score in a randomized within-subjects test and an improvement of 3.18 times in mean task completion duration compared to a conventional solution."]}
{"id": "14", "text": ["We follow this by conducting a reproducibility study of eight papers published in EMNLP 2021, finding that source code releases leave much to be desired."]}
{"id": "15", "text": ["Used internationally, initial qualitative feedback from teachers who attended pilot CS-SIC workshops was emphatically positive."]}
{"id": "16", "text": ["In human-computer interaction (HCI), there has been a push towards open science, but to date, this has not happened consistently for HCI research utilizing brain signals due to unclear guidelines to support reuse and reproduction."]}
{"id": "17", "text": ["Extensive experimental results on real-world trust networks demonstrate the superior performance of our proposed method over the state-of-the-arts."]}
{"id": "18", "text": ["In modern machine learning, we observe the phenomenon of opaqueness debt, which manifests itself by an increased risk of discrimination, lack of reproducibility, and deated performance due to data drift."]}
{"id": "19", "text": ["We study the problem of learning a node-labeled tree given independent traces from an appropriately defined deletion channel."]}